MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_pka.h
/**
  * @brief  Disable RAM error interrupt.
  * @rmtoll
  *  CR           RAMERRIE      LL_PKA_DisableIT_RAMERR
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_DisableIT_RAMERR(PKA_TypeDef *pkax)
{
  STM32_CLEAR_BIT(pkax->CR, PKA_CR_RAMERRIE);
}
/**
  * @brief  Disable End of operation interrupt.
  * @rmtoll
  *  CR           PROCENDIE     LL_PKA_DisableIT_PROCEND
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_DisableIT_PROCEND(PKA_TypeDef *pkax)
{
  STM32_CLEAR_BIT(pkax->CR, PKA_CR_PROCENDIE);
}
/**
  * @brief  Disable OPERATION error interrupt.
  * @rmtoll
  *  CR           OPERRIE      LL_PKA_DisableIT_OPERR
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_DisableIT_OPERR(PKA_TypeDef *pkax)
{
  STM32_CLEAR_BIT(pkax->CR, PKA_CR_OPERRIE);
}
/**
  * @brief  Disable chaining mode flags interrupt.
  * @rmtoll
  *  CR           CMFIE   LL_PKA_DisableIT_CMFIE
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_DisableIT_CMFIE(PKA_TypeDef *pkax)
{
  STM32_CLEAR_BIT(pkax->CR, PKA_CR_CMFIE);
}
/** @brief  Disable the specified PKA interrupt.
  * @param  pkax specifies the PKA instance.
  * @param  it_source specifies the interrupt source to disable.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_PKA_IT_PROCEND End Of Operation interrupt enable
  *            @arg @ref LL_PKA_IT_ADDRERR Address error interrupt enable
  *            @arg @ref LL_PKA_IT_RAMERR RAM error interrupt enable
  *            @arg @ref LL_PKA_IT_OPERR Operation error interrupt enable
  *            @arg @ref LL_PKA_IT_CMFIE Chaining mode flags interrupt enable
  */
__STATIC_INLINE void LL_PKA_DisableIT(PKA_TypeDef *pkax, uint32_t it_source)
{
  STM32_CLEAR_BIT(pkax->CR, it_source);
}
/**
  * @brief  Check if address error interrupt is enabled.
  * @rmtoll
  *  CR           ADDRERRIE     LL_PKA_IsEnabledIT_ADDRERR
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsEnabledIT_ADDRERR(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->CR, PKA_CR_ADDRERRIE) == (PKA_CR_ADDRERRIE)) ? 1UL : 0UL);
}
/**
  * @brief  Check if RAM error interrupt is enabled.
  * @rmtoll
  *  CR           RAMERRIE      LL_PKA_IsEnabledIT_RAMERR
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsEnabledIT_RAMERR(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->CR, PKA_CR_RAMERRIE) == (PKA_CR_RAMERRIE)) ? 1UL : 0UL);
}
/**
  * @brief  Check if OPERATION error interrupt is enabled.
  * @rmtoll
  *  CR           OPERRIE      LL_PKA_IsEnabledIT_OPERR
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsEnabledIT_OPERR(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->CR, PKA_CR_OPERRIE) == (PKA_CR_OPERRIE)) ? 1UL : 0UL);
}
/**
  * @brief  Check if end of operation interrupt is enabled.
  * @rmtoll
  *  CR           PROCENDIE     LL_PKA_IsEnabledIT_PROCEND
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsEnabledIT_PROCEND(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->CR, PKA_CR_PROCENDIE) == (PKA_CR_PROCENDIE)) ? 1UL : 0UL);
}
/**
  * @brief  Check if chaining mode flags interrupt is enabled.
  * @rmtoll
  *  CR           CMFIE     LL_PKA_IsEnabledIT_CMFIE
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsEnabledIT_CMFIE(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->CR, PKA_CR_CMFIE) == (PKA_CR_CMFIE)) ? 1UL : 0UL);
}
/**
  * @}
  */
/** @defgroup PKA_LL_EF_FLAG_Management PKA flag management
  * @{
  */
/**
  * @brief  Get PKA address error flag.
  * @rmtoll
  *  SR           ADDRERRF      LL_PKA_IsActiveFlag_ADDRERR
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag_ADDRERR(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->SR, PKA_SR_ADDRERRF) == (PKA_SR_ADDRERRF)) ? 1UL : 0UL);
}
/**
  * @brief  Get PKA RAM error flag.
  * @rmtoll
  *  SR           RAMERRF      LL_PKA_IsActiveFlag_RAMERR
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag_RAMERR(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->SR, PKA_SR_RAMERRF) == (PKA_SR_RAMERRF)) ? 1UL : 0UL);
}
/**
  * @brief  Get PKA OPERATION error flag.
  * @rmtoll
  *  SR           OPERRF      LL_PKA_IsActiveFlag_OPERR
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag_OPERR(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->SR, PKA_SR_OPERRF) == (PKA_SR_OPERRF)) ? 1UL : 0UL);
}
/**
  * @brief  Get PKA end of operation flag.
  * @rmtoll
  *  SR           PROCENDF      LL_PKA_IsActiveFlag_PROCEND
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag_PROCEND(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->SR, PKA_SR_PROCENDF) == (PKA_SR_PROCENDF)) ? 1UL : 0UL);
}
/**
  * @brief  Get PKA busy flag.
  * @rmtoll
  *  SR           BUSY          LL_PKA_IsActiveFlag_BUSY
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag_BUSY(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->SR, PKA_SR_BUSY) == (PKA_SR_BUSY)) ? 1UL : 0UL);
}
/**
  * @brief  Get PKA INITOK flag.
  * @rmtoll
  *  SR           INITOK      LL_PKA_IsActiveFlag_INITOK
  * @param  pkax PKA Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag_INITOK(const PKA_TypeDef *pkax)
{
  return ((STM32_READ_BIT(pkax->SR, PKA_SR_INITOK) == (PKA_SR_INITOK)) ? 1UL : 0UL);
}
/**
  * @brief  Get PKA flag.
  * @rmtoll
  *  SR           RAMERRF       LL_PKA_IsActiveFlag_RAMERR
  * @param  pkax PKA Instance.
  * @param  flag This parameter can be one of the following values:
  *              @arg @ref LL_PKA_FLAG_ADDRERR
  *              @arg @ref LL_PKA_FLAG_RAMERR
  *              @arg @ref LL_PKA_FLAG_PROCEND
  *              @arg @ref LL_PKA_FLAG_BUSY
  *              @arg @ref LL_PKA_FLAG_INITOK
  *              @arg @ref LL_PKA_FLAG_OPERR
  *              @arg @ref LL_PKA_FLAG_CMF
  *              @arg @ref LL_PKA_FLAG_RNGERRF
  *              @arg @ref LL_PKA_FLAG_MDERRF
  *              @arg @ref LL_PKA_FLAG_CMF
  *              @arg @ref LL_PKA_FLAG_TRZERRF
  *              @arg @ref LL_PKA_FLAG_DATAZF
  *              @arg @ref LL_PKA_FLAG_INCRERRF
  *              @arg @ref LL_PKA_FLAG_DATAOKF
  *              @arg @ref LL_PKA_FLAG_RNGOKF
  *              @arg @ref LL_PKA_FLAG_CCEN
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PKA_IsActiveFlag(const PKA_TypeDef *pkax, uint32_t flag)
{
  return ((STM32_READ_BIT(pkax->SR, flag) == (flag)) ? 1UL : 0UL);
}
/**
  * @brief  Clear PKA address error flag.
  * @rmtoll
  *  CLRFR        ADDRERRFC     LL_PKA_ClearFlag_ADDERR
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_ClearFlag_ADDERR(PKA_TypeDef *pkax)
{
  STM32_SET_BIT(pkax->CLRFR, PKA_CLRFR_ADDRERRFC);
}
/**
  * @brief  Clear PKA RAM error flag.
  * @rmtoll
  *  CLRFR        RAMERRFC      LL_PKA_ClearFlag_RAMERR
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_ClearFlag_RAMERR(PKA_TypeDef *pkax)
{
  STM32_SET_BIT(pkax->CLRFR, PKA_CLRFR_RAMERRFC);
}
/**
  * @brief  Clear PKA OPERATION error flag.
  * @rmtoll
  *  CLRFR        OPERRFC      LL_PKA_ClearFlag_OPERR
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_ClearFlag_OPERR(PKA_TypeDef *pkax)
{
  STM32_SET_BIT(pkax->CLRFR, PKA_CLRFR_OPERRFC);
}
/**
  * @brief   Clear chaining mode flag.
  * @rmtoll
  *  CLRFR        CMFC     LL_PKA_ClearFlag_CMFC
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_ClearFlag_CMFC(PKA_TypeDef *pkax)
{
  STM32_SET_BIT(pkax->CLRFR, PKA_CLRFR_CMFC);
}
/**
  * @brief  Clear PKA end of operation flag.
  * @rmtoll
  *  CLRFR        PROCENDFC     LL_PKA_ClearFlag_PROCEND
  * @param  pkax PKA Instance.
  */
__STATIC_INLINE void LL_PKA_ClearFlag_PROCEND(PKA_TypeDef *pkax)
{
  STM32_SET_BIT(pkax->CLRFR, PKA_CLRFR_PROCENDFC);
}
/** @brief  Clear the PKA pending flags which are cleared by writing 1 in a specific bit.
  * @param  pkax specifies the PKA instance.
  * @param  clear_flag specifies the flag to clear.
  *         This parameter can be any combination of the following values:
  *            @arg @ref LL_PKA_FLAG_PROCEND End Of Operation
  *            @arg @ref LL_PKA_FLAG_ADDRERR Address error
  *            @arg @ref LL_PKA_FLAG_RAMERR RAM error
  *            @arg @ref LL_PKA_FLAG_OPERR Operation error
  *            @arg @ref LL_PKA_FLAG_CMF Chaining mode
  */
__STATIC_INLINE void LL_PKA_ClearFlag(PKA_TypeDef *pkax, uint32_t clear_flag)
{
  STM32_SET_BIT(pkax->CLRFR, clear_flag);
}
/**
  * @}
  */
/**
  * @}
  */
/**
  * @}
  */
#endif /* defined(PKA) */
/**
  * @}
  */
#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* STM32C5XX_LL_PKA_H */
